benchmarks/result2.log
2         Threads
100       Connections per thread
30        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         3643.43          ---          ---         5.00114         4.54300        11.07100        32.38300       280.52 
Gets        36397.54         0.00     36397.54         4.98989         4.54300        10.81500        31.23100      1417.98 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      40040.97         0.00     36397.54         4.99091         4.54300        10.81500        31.35900      1698.50 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.855        0.000
SET       3.743        5.000
SET       3.887       10.000
SET       3.983       15.000
SET       4.047       20.000
SET       4.127       25.000
SET       4.191       30.000
SET       4.255       35.000
SET       4.351       40.000
SET       4.415       45.000
SET       4.543       50.000
SET       4.607       52.500
SET       4.671       55.000
SET       4.735       57.500
SET       4.799       60.000
SET       4.895       62.500
SET       4.991       65.000
SET       5.087       67.500
SET       5.215       70.000
SET       5.311       72.500
SET       5.471       75.000
SET       5.535       76.250
SET       5.599       77.500
SET       5.695       78.750
SET       5.759       80.000
SET       5.823       81.250
SET       5.919       82.500
SET       6.015       83.750
SET       6.111       85.000
SET       6.207       86.250
SET       6.303       87.500
SET       6.335       88.125
SET       6.399       88.750
SET       6.463       89.375
SET       6.527       90.000
SET       6.559       90.625
SET       6.623       91.250
SET       6.687       91.875
SET       6.783       92.500
SET       6.847       93.125
SET       6.911       93.750
SET       6.975       94.062
SET       7.039       94.375
SET       7.071       94.688
SET       7.135       95.000
SET       7.199       95.312
SET       7.295       95.625
SET       7.359       95.938
SET       7.455       96.250
SET       7.551       96.562
SET       7.647       96.875
SET       7.711       97.031
SET       7.807       97.188
SET       7.871       97.344
SET       7.967       97.500
SET       8.031       97.656
SET       8.127       97.812
SET       8.255       97.969
SET       8.447       98.125
SET       8.639       98.281
SET       8.831       98.438
SET       8.959       98.516
SET       9.151       98.594
SET       9.407       98.672
SET       9.663       98.750
SET       9.983       98.828
SET      10.303       98.906
SET      10.943       98.984
SET      11.647       99.062
SET      12.351       99.141
SET      13.183       99.219
SET      13.631       99.258
SET      14.143       99.297
SET      14.655       99.336
SET      15.295       99.375
SET      15.999       99.414
SET      16.895       99.453
SET      17.663       99.492
SET      18.559       99.531
SET      19.455       99.570
SET      20.607       99.609
SET      21.119       99.629
SET      21.631       99.648
SET      22.143       99.668
SET      22.527       99.688
SET      23.039       99.707
SET      23.295       99.727
SET      23.807       99.746
SET      24.319       99.766
SET      25.087       99.785
SET      25.727       99.805
SET      26.111       99.814
SET      26.367       99.824
SET      26.623       99.834
SET      27.135       99.844
SET      27.775       99.854
SET      28.671       99.863
SET      29.055       99.873
SET      29.567       99.883
SET      30.719       99.893
SET      33.023       99.902
SET      33.279       99.907
SET      34.047       99.912
SET      34.559       99.917
SET      35.327       99.922
SET      36.351       99.927
SET      37.887       99.932
SET      39.423       99.937
SET      40.447       99.941
SET      40.959       99.946
SET      41.983       99.951
SET      42.751       99.954
SET      42.751       99.956
SET      43.263       99.958
SET      43.263       99.961
SET      44.031       99.963
SET      44.543       99.966
SET      45.055       99.968
SET      45.567       99.971
SET      46.079       99.973
SET      46.847       99.976
SET      47.103       99.977
SET      47.359       99.978
SET      48.127       99.979
SET      48.383       99.980
SET      48.895       99.982
SET      50.175       99.983
SET      50.431       99.984
SET      51.199       99.985
SET      51.967       99.987
SET      51.967       99.988
SET      51.967       99.988
SET      51.967       99.989
SET      52.479       99.990
SET      52.735       99.990
SET      52.735       99.991
SET      54.783       99.991
SET      54.783       99.992
SET      54.783       99.993
SET      55.039       99.993
SET      57.343       99.994
SET      57.343       99.994
SET      57.343       99.995
SET      57.855       99.995
SET      57.855       99.995
SET      57.855       99.995
SET      57.855       99.996
SET      57.855       99.996
SET      57.855       99.996
SET      58.879       99.997
SET      58.879       99.997
SET      58.879       99.997
[...]
SET      59.135       99.997
SET      59.135       99.998
SET      59.135       99.998
SET      59.135       99.998
[...]
SET      60.415       99.998
SET      60.415       99.998
SET      60.415       99.999
SET      60.415       99.999
SET      60.415       99.999
[...]
SET      60.927       99.999
SET      60.927      100.000
---
GET       0.839        0.000
GET       3.727        5.000
GET       3.887       10.000
GET       3.983       15.000
GET       4.047       20.000
GET       4.127       25.000
GET       4.191       30.000
GET       4.255       35.000
GET       4.351       40.000
GET       4.415       45.000
GET       4.543       50.000
GET       4.607       52.500
GET       4.671       55.000
GET       4.735       57.500
GET       4.799       60.000
GET       4.895       62.500
GET       4.991       65.000
GET       5.087       67.500
GET       5.215       70.000
GET       5.311       72.500
GET       5.471       75.000
GET       5.535       76.250
GET       5.599       77.500
GET       5.663       78.750
GET       5.759       80.000
GET       5.823       81.250
GET       5.919       82.500
GET       6.015       83.750
GET       6.079       85.000
GET       6.175       86.250
GET       6.303       87.500
GET       6.335       88.125
GET       6.399       88.750
GET       6.463       89.375
GET       6.495       90.000
GET       6.559       90.625
GET       6.623       91.250
GET       6.687       91.875
GET       6.751       92.500
GET       6.847       93.125
GET       6.911       93.750
GET       6.975       94.062
GET       7.007       94.375
GET       7.071       94.688
GET       7.135       95.000
GET       7.199       95.312
GET       7.263       95.625
GET       7.327       95.938
GET       7.423       96.250
GET       7.519       96.562
GET       7.615       96.875
GET       7.711       97.031
GET       7.775       97.188
GET       7.839       97.344
GET       7.935       97.500
GET       8.031       97.656
GET       8.127       97.812
GET       8.255       97.969
GET       8.383       98.125
GET       8.575       98.281
GET       8.767       98.438
GET       8.895       98.516
GET       9.087       98.594
GET       9.279       98.672
GET       9.471       98.750
GET       9.791       98.828
GET      10.175       98.906
GET      10.687       98.984
GET      11.327       99.062
GET      11.967       99.141
GET      12.671       99.219
GET      13.119       99.258
GET      13.503       99.297
GET      14.079       99.336
GET      14.655       99.375
GET      15.423       99.414
GET      16.255       99.453
GET      17.151       99.492
GET      18.047       99.531
GET      19.071       99.570
GET      20.095       99.609
GET      20.479       99.629
GET      20.991       99.648
GET      21.503       99.668
GET      21.887       99.688
GET      22.399       99.707
GET      23.039       99.727
GET      23.551       99.746
GET      24.191       99.766
GET      24.831       99.785
GET      25.471       99.805
GET      25.727       99.814
GET      26.239       99.824
GET      26.623       99.834
GET      27.007       99.844
GET      27.647       99.854
GET      28.287       99.863
GET      28.927       99.873
GET      29.567       99.883
GET      30.463       99.893
GET      31.615       99.902
GET      32.383       99.907
GET      33.023       99.912
GET      33.791       99.917
GET      34.559       99.922
GET      35.327       99.927
GET      36.351       99.932
GET      37.375       99.937
GET      38.399       99.941
GET      39.423       99.946
GET      40.703       99.951
GET      41.215       99.954
GET      41.727       99.956
GET      42.239       99.958
GET      42.751       99.961
GET      43.519       99.963
GET      44.031       99.966
GET      44.543       99.968
GET      45.055       99.971
GET      45.823       99.973
GET      46.591       99.976
GET      47.103       99.977
GET      47.615       99.978
GET      48.127       99.979
GET      48.639       99.980
GET      49.151       99.982
GET      49.663       99.983
GET      49.919       99.984
GET      50.431       99.985
GET      50.943       99.987
GET      51.455       99.988
GET      51.711       99.988
GET      51.967       99.989
GET      52.479       99.990
GET      52.991       99.990
GET      53.247       99.991
GET      53.759       99.991
GET      54.271       99.992
GET      54.527       99.993
GET      55.039       99.993
GET      55.551       99.994
GET      55.551       99.994
GET      56.063       99.995
GET      56.063       99.995
GET      56.319       99.995
GET      56.575       99.995
GET      57.087       99.996
GET      57.599       99.996
GET      57.855       99.996
GET      58.111       99.997
GET      58.367       99.997
GET      58.623       99.997
GET      58.879       99.997
GET      58.879       99.997
GET      59.647       99.998
GET      59.647       99.998
GET      59.903       99.998
GET      59.903       99.998
GET      60.159       99.998
GET      60.159       99.998
GET      60.415       99.998
GET      60.415       99.999
GET      60.415       99.999
GET      60.415       99.999
GET      60.671       99.999
GET      60.671       99.999
GET      60.671       99.999
[...]
GET      60.927       99.999
GET      60.927       99.999
GET      60.927       99.999
[...]
GET      60.927      100.000
GET      60.927      100.000
GET      61.183      100.000
GET      61.183      100.000
GET      61.439      100.000
GET      61.439      100.000
GET      61.439      100.000
[...]
GET      61.951      100.000
GET      61.951      100.000
GET      61.951      100.000
[...]
GET      63.999      100.000
GET      63.999      100.000
---
WAIT      0.000      100.000